{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "How are you?",
                "Is anyone there?",
                "Hello",
                "Good day",
                "What's up",
                "how are ya",
                "heyy",
                "whatsup",
                "??? ??? ??"
            ],
            "responses": [
                "Hello!",
                "Good to see you again!",
                "Hi there, how can I help?"
            ],
            "context_set": ""
        },
        {
            "tag": "goodbye",
            "patterns": [
                "cya",
                "see you",
                "bye bye",
                "See you later",
                "Goodbye",
                "I am Leaving",
                "Bye",
                "Have a Good day",
                "talk to you later",
                "ttyl",
                "i got to go",
                "gtg"
            ],
            "responses": [
                "Sad to see you go :(",
                "Talk to you later",
                "Goodbye!",
                "Come back soon"
            ],
            "context_set": ""
        },
        {
            "tag": "creator",
            "patterns": [
                "what is the name of your developers",
                "what is the name of your creators",
                "what is the name of the developers",
                "what is the name of the creators",
                "who created you",
                "your developers",
                "your creators",
                "who are your developers",
                "developers",
                "you are made by",
                "you are made by whom",
                "who created you",
                "who create you",
                "creators",
                "who made you",
                "who designed you"
            ],
            "responses": [
                "I am AI powered chatbot to answer questions related to Inventory Management System"
            ],
            "context_set": ""
        },
        {
            "tag": "name",
            "patterns": [
                "name",
                "your name",
                "do you have a name",
                "what are you called",
                "what is your name",
                "what should I call you",
                "whats your name?",
                "what are you",
                "who are you",
                "who is this",
                "what am i chatting to",
                "who am i taking to",
                "what are you"
            ],
            "responses": [
                "You can call me Mind Reader.",
                "I'm Mind Reader",
                "I am a Chatbot.",
                "I am your helper"
            ],
            "context_set": ""
        },
        {
            "tag": "inventory",
            "patterns": [
                "How can I check the current inventory level?",
                "Is there a way to view the inventory status?",
                "Can you provide information about the stock availability?",
                "What is the current quantity of product X in the inventory?",
                "Do you have enough stock of product X?"
            ],
            "responses": [
                "To check the current inventory level, you can navigate to the 'Inventory' section in the system. There, you will find the list of products along with their respective quantities in stock.",
                "Yes, you can view the inventory status by accessing the 'Inventory' section. It provides an overview of the available products and their quantities.",
                "The system allows you to monitor the stock availability. Simply visit the 'Inventory' page to see the real-time status of each product.",
                "The current quantity of product X in the inventory is [quantity].",
                "Yes, we have enough stock of product X. You can place an order without any concerns about availability."
            ],
            "context_set": ""
        },
        {
            "tag": "inventory_status",
            "patterns": [
                "What is the current status of my inventory?",
                "Can you provide an overview of my inventory?",
                "Show me the inventory status.",
                "What is the stock situation?",
                "Give me an update on my inventory."
            ],
            "responses": [
                "Your inventory is in good shape. You have a sufficient quantity of products in stock.",
                "The current status of your inventory is stable. All products are well-stocked and ready for sale.",
                "As per the latest update, your inventory is in a healthy state with no shortages reported.",
                "Your inventory status is positive. There are no major concerns or issues to address.",
                "Based on the recent analysis, your inventory is well-maintained and adequately stocked."
            ],
            "context_set": ""
        },
        {
            "tag": "order",
            "patterns": [
                "Can you track my recent order?",
                "Where is my order?",
                "Give me an update on my order status.",
                "I want to know the progress of my order.",
                "When will my order arrive?"
            ],
            "responses": [
                "Sure, let me check the status of your order. Please provide me with the order details.",
                "To track your order, I need the order number. Could you please provide it?",
                "I can assist you with tracking your order. Please share the order details with me.",
                "Tracking your order is a priority. Please provide the necessary information, such as the order number.",
                "To provide an update on your order status, I'll need the order details. Please provide them."
            ],
            "context_set": ""
        },
        {
            "tag": "out",
            "patterns": [
                "What happens if a product is out of stock?",
                "How do you handle products that are out of stock?",
                "What should I do if an item is not available?",
                "What is the procedure for managing out-of-stock products?",
                "What happens when a product is marked as out of stock?"
            ],
            "responses": [
                "If a product is out of stock, it will be marked as unavailable for purchase. Customers will not be able to order it until it is restocked.",
                "When a product is out of stock, we update the inventory status accordingly. Customers will be notified that the item is currently unavailable.",
                "In the case of an out-of-stock product, we take the necessary steps to replenish the inventory as soon as possible. Customers will be informed about the expected restocking time.",
                "For out-of-stock products, we closely monitor the inventory and prioritize restocking. Customers will be notified about the availability status and given alternative options, if applicable.",
                "When a product is out of stock, we promptly update the inventory records and take steps to restock it. Customers will be notified about the unavailability and provided with alternative choices, if available."
            ],
            "context_set": ""
        },
        {
            "tag": "inventory_reports",
            "patterns": [
                "Can I generate inventory reports?",
                "How can I access inventory reports?",
                "What kind of inventory reports are available?",
                "Are there any predefined inventory reports?",
                "Tell me about the reporting capabilities of the inventory system."
            ],
            "responses": [
                "Yes, our inventory system provides reporting capabilities. You can generate various inventory reports, such as stock levels, sales analysis, and product performance.",
                "To access inventory reports, navigate to the 'Reports' section of the inventory system. There, you will find a range of predefined reports and options to customize and generate reports based on your requirements.",
                "Our inventory system offers a comprehensive set of predefined inventory reports, including inventory valuation, stock turnover, and sales trends. You can also create custom reports based on specific criteria.",
                "The inventory system provides a wide range of predefined reports"
            ],
            "context_set": ""
        },
        {
            "tag": "price",
            "patterns": [
                "What is the price of product X?",
                "How much does product X cost?",
                "Can you provide the price for product X?",
                "What is the selling price of product X?",
                "Is there a discount on product X?"
            ],
            "responses": [
                "The price of product X is $10.",
                "Product X costs $10.",
                "The selling price of product X is $10.",
                "Currently, there is no discount on product X.",
                "The regular price of product X is $10."
            ],
            "context_set": ""
        },
        {
            "tag": "vendor",
            "patterns": [
                "Who is the vendor of product X?",
                "Can you provide the supplier information for product X?",
                "Which company supplies product X?",
                "Where does product X come from?",
                "Who manufactures product X?"
            ],
            "responses": [
                "The vendor of product X is Company Y.",
                "Product X is supplied by Company Y.",
                "Company Y is the supplier of product X.",
                "Product X comes from Company Y.",
                "The manufacturer of product X is Company Y."
            ],
            "context_set": ""
        },
        {
            "tag": "availability",
            "patterns": [
                "Is product X in stock?",
                "Do you have product X available?",
                "Is product X currently available for purchase?",
                "What is the stock status of product X?",
                "Can I order product X?"
            ],
            "responses": [
                "Yes, product X is currently in stock.",
                "Product X is available and ready for purchase.",
                "We have product X in stock. You can place an order.",
                "Product X is currently available for purchase.",
                "Yes, you can order product X."
            ],
            "context_set": ""
        },
        {
            "tag": "sales",
            "patterns": [
                "How many sales have been made today?",
                "Can you provide the total sales for today?",
                "What is the number of sales today?",
                "Tell me the sales count for today.",
                "How many products have been sold today?"
            ],
            "responses": [
                "To check the sales for today, you can go to the 'Sales' or 'Reports' section in the system. There, you will find the option to view the sales summary or generate a report specifically for today's sales. This report will provide you with the total number of sales made, the revenue generated, and other relevant information."
            ],
            "context_set": ""
        },
        {
            "tag": "description",
            "patterns": [
                "Can you provide more information about product X?",
                "What are the specifications of product X?",
                "Do you have a detailed description for product X?",
                "Tell me more about product X.",
                "Can you provide product X's features?"
            ],
            "responses": [
                "Product X is a high-quality item made from durable materials. It comes in various sizes and colors.",
                "Product X is designed to meet your inventory needs. It offers a range of features that make it suitable for various applications.",
                "With Product X, you can easily manage and organize your inventory. It is compatible with existing inventory management systems and offers scalability to accommodate your needs.",
                "Here are some key specifications of Product X: [Provide relevant specifications]",
                "Product X's features include: [List relevant features]"
            ]
        },
        {
            "tag": "add",
            "patterns": [
                "How can I add a new product to the inventory?",
                "What is the process to add a product?",
                "Can you guide me on adding products to the inventory?",
                "I want to add a new product. What steps should I follow?",
                "What are the requirements for adding a product to the inventory?"
            ],
            "responses": [
                "To add a new product to the inventory, you can go to the 'Add Product' section in the system. Fill in the required information such as product name, description, quantity, price, and any other relevant details. Click on the 'Add' button to save the product to the inventory."
            ],
            "context_set": ""
        },
        {
            "tag": "remove",
            "patterns": [
                "How can I remove a product from the inventory?",
                "What is the process to delete a product?",
                "Can you guide me on removing products from the inventory?",
                "I want to remove a product. What steps should I follow?",
                "What are the requirements for deleting a product from the inventory?"
            ],
            "responses": [
                "To remove a product from the inventory, locate the product in the system and select the 'Remove' or 'Delete' option. Confirm the action when prompted to remove the product permanently from the inventory."
            ],
            "context_set": ""
        },
        {
            "tag": "update",
            "patterns": [
                "How can I update the information of a product?",
                "What is the process to modify product details?",
                "Can you guide me on updating product information?",
                "I want to make changes to a product. What steps should I follow?",
                "What are the requirements for updating product information?"
            ],
            "responses": [
                "To update the information of a product, navigate to the product details page and edit the desired fields such as name, description, price, quantity, or any other relevant attributes. Save the changes to update the product information in the inventory."
            ],
            "context_set": ""
        },
        {
            "tag": "delete",
            "patterns": [
                "How can I delete product information?",
                "What is the process to remove product details?",
                "Can you guide me on deleting product information?",
                "I want to delete the information of a product. What steps should I follow?",
                "What are the requirements for removing product information?"
            ],
            "responses": [
                "To delete product information, locate the product in the system and choose the 'Delete Information' option. Confirm the action when prompted to remove the product details from the inventory. Please note that this action will permanently delete the product information."
            ],
            "context_set": ""
        },
        {
            "tag": "quantity",
            "patterns": [
                "How many units of product X are available?",
                "What is the current stock quantity of product X?",
                "Can you provide the inventory count for product X?",
                "How much stock is left for product X?",
                "What is the quantity on hand for product X?"
            ],
            "responses": [
                "The current stock quantity of product X is 100 units.",
                "Product X has 100 units available in stock.",
                "The inventory count for product X is 100 units.",
                "There are 100 units of product X in stock.",
                "Product X has a quantity on hand of 100 units."
            ],
            "context_set": ""
        },
        {
            "tag": "product_search",
            "patterns": [
                "How can I search for a specific product?",
                "Is there a search feature to find products?",
                "Can you assist me in finding a particular product?",
                "What options do I have to search for products?",
                "How does the product search functionality work?"
            ],
            "responses": [
                "Our inventory system includes a search feature that allows you to find specific products. Simply enter the product name or relevant keywords, and the system will display the matching results.",
                "You can use the search functionality in our inventory system to locate a specific product. Enter the product name or any related details, and the system will present you with the search results.",
                "To find a particular product, use the search bar in our inventory system. Enter the product name, SKU, or any other relevant information, and the system will provide you with the matching results.",
                "Finding a specific product is easy with our inventory system's search feature. Enter the product"
            ],
            "context_set": ""
        },
        {
            "tag": "product_details",
            "patterns": [
                "Can you provide more details about a product?",
                "What information can I get about a specific product?",
                "Tell me about the specifications of a product.",
                "What are the features of a particular product?",
                "Can you give me a description of a product?"
            ],
            "responses": [
                "Certainly! I can provide you with more details about a product. Please provide me with the name or SKU of the product you are interested in.",
                "To get more information about a specific product, please let me know the name or SKU of the product, and I will fetch the details for you.",
                "If you have a specific product in mind, simply provide me with the name or SKU, and I'll fetch the product details including specifications, features, and description.",
                "I'd be happy to provide you with more details about a particular product. Just let me know the name or SKU, and I'll fetch the relevant information for you.",
                "Sure! If you give me the name or SKU of the product, I can give you a description and other details such as specifications and features."
            ],
            "context_set": ""
        },
        {
            "tag": "discount",
            "patterns": [
                "Are there any discounts available?",
                "Can I get a discount on product X?",
                "Do you offer promotional discounts?",
                "How can I avail discounts?",
                "Are there any ongoing sales or offers?"
            ],
            "responses": [
                "Yes, we have some exciting discounts available. Visit the 'Offers' or 'Discounts' section on our website to explore the current promotions and avail discounts on your favorite products.",
                "Discounts are periodically offered on different products, including product X. Keep an eye on our website or subscribe to our newsletter to stay updated on the latest discounts.",
                "We have promotional discounts from time to time. To know the current offers, visit our website's 'Discounts' section or contact our customer support for more details.",
                "To avail discounts, you can apply coupon codes during the checkout process. Keep an eye on our promotional emails or check our website for any ongoing discount offers.",
                "Yes, we regularly have sales and offers running. Visit our website or follow our social media channels to stay informed about the latest discounts and promotions."
            ],
            "context_set": ""
        },
        {
            "tag": "low",
            "patterns": [
                "How do I know if a product is running low on stock?",
                "Is there a way to monitor low stock items?",
                "Can you alert me when a product is running out of stock?",
                "What happens if a product's stock level is low?",
                "How can I keep track of products that are running low on stock?"
            ],
            "responses": [
                "Our inventory system has a feature to monitor low stock items. You will receive alerts when a product's stock level falls below a certain threshold.",
                "You can set up notifications to be alerted when a product's stock level is running low. This will help you proactively manage inventory and restock as needed.",
                "When a product's stock level is low, our inventory system will automatically notify you. This ensures that you can take timely action to replenish the stock.",
                "Monitoring low stock items is an important aspect of inventory management. Our system will alert you when a product's stock level reaches a predefined threshold.",
                "To keep track of products that are running low on stock, you can set up notifications in our inventory system. This will help you maintain optimal stock levels and prevent stockouts."
            ],
            "context_set": ""
        },
        {
            "tag": "placement",
            "patterns": [
                "How can I place an order for products?",
                "What is the process for ordering items?",
                "Can you guide me on placing an order?",
                "I want to purchase products. What steps should I follow?",
                "What are the requirements for placing an order?"
            ],
            "responses": [
                "To place an order for products, you can use our online ordering portal. Simply browse the catalog, select the desired items, and proceed to the checkout process.",
                "We offer an easy and streamlined process for placing orders. You can either use our online ordering platform or get in touch with our sales team to place your order.",
                "Placing an order is straightforward. Visit our website or contact our sales team to discuss your requirements and initiate the order placement process.",
                "To purchase products, you can use our online order form. Fill in the required details, including the product names, quantities, and any specific instructions, and submit the form.",
                "We have a user-friendly ordering system that allows you to place orders with ease. You can access our online portal, select the desired items, specify quantities, and complete the ordering process."
            ],
            "context_set": ""
        },
        {
            "tag": "swear",
            "patterns": [
                "fuck",
                "bitch",
                "shut up",
                "hell",
                "stupid",
                "idiot",
                "dumb ass",
                "asshole",
                "fucker"
            ],
            "responses": [
                "please use appropriate language",
                "Maintaining decency would be appreciated"
            ],
            "context_set": ""
        },
        {
            "tag": "salutaion",
            "patterns": [
                "okk",
                "okie",
                "nice work",
                "well done",
                "good job",
                "thanks for the help",
                "Thank You",
                "its ok",
                "Thanks",
                "Good work",
                "k",
                "ok",
                "okay"
            ],
            "responses": [
                "I am glad I helped you",
                "welcome, anything else i can assist you with?"
            ],
            "context_set": ""
        },
        {
            "tag": "task",
            "patterns": [
                "what can you do",
                "what are the thing you can do",
                "things you can do",
                "what can u do for me",
                "how u can help me",
                "why i should use you"
            ],
            "responses": [
                "I can answer to questions related to inventory",
                "You can ask me questions regarding inventory"
            ],
            "context_set": ""
        }
    ]
}